Revit 2027 API
TessellatedShapeBuilder.OpenConnectedFaceSet Method
 Opens a new connected face set.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void OpenConnectedFaceSet(
	bool isSolid
)
Public Sub OpenConnectedFaceSet (
	isSolid As Boolean
)
public:
void OpenConnectedFaceSet(
	bool isSolid
)
member OpenConnectedFaceSet :
        isSolid : bool -> unit
Parameters
isSolid Boolean
 Whether the face set, which is being open, should be build as a solid or as a void.
Exceptions
Exception | Condition
InvalidOperationException |  A face set is open and a geometry cannot be build until it is closed.
See Also
Reference
TessellatedShapeBuilder Class
Autodesk.Revit.DB Namespace